---
kind: method
id: M:Autodesk.Revit.DB.OffsetSurface.GetOffsetDistance
source: html/580da623-2d47-9eea-e549-497b32a82d03.htm
---
# Autodesk.Revit.DB.OffsetSurface.GetOffsetDistance Method

Returns offset distance of this OffsetSurface.

## Syntax (C#)
```csharp
public double GetOffsetDistance()
```

## Returns
Offset distance of this OffsetSurface.